[
  {
    "id": "betterfingers",
    "featured": true,
    "realName": "BetterFingers",
    "codename": "Sigil Script",
    "category": "productivity",
    "status": "released",
    "statusLabel": "UNSEALED",
    "tagline": "Voice-to-Will invocation layer.",
    "plainDescription": "A TTS and voice-to-text accessibility app that refines spoken thought into polished, expressive text for any application.",
    "flavorDescription": "It intercepts spoken incantations and transmutes them into precise macro sequences or raw code, serving as a bridge between voice and the machine spirit.",
    "fullDescription": [
      "BetterFingers is an accessibility ecosystem designed to help people read documents and express themselves authentically. It doesn’t simply repeat text verbatim; instead, it refines it to achieve a formal, natural, or expressive feel, enabling users to quickly and efficiently convey their ideas without overthinking.",
      "It also bridges the gap between controller use and rapid typing in chat, offering a significant speed advantage over traditional keyboard input, particularly for longer passages. Whether running on modest devices or high-performance machines, it adapts to your hardware with interchangeable models—giving you the flavor of a refined digital soul without the latency of the cloud."
    ],
    "features": [
      "Voice-to-Text with Style Refinement",
      "High-Quality Text-to-Speech (TTS)",
      "Custom Personas & Voice Cloning",
      "Controller Input Support",
      "Works in Any App",
      "Interchangeable AI Models (Whisper to LLMs)",
      "Zero Latency Local Processing"
    ],
    "flagshipFeatures": [
      "Speech Refinement:: Instantly transforms raw spoken notes into polished, professional, or expressive text.",
      "Controller Input & Personas:: Seamlessly switch between voice and controller inputs, utilizing custom personas for different contexts.",
      "Adaptive Local Intelligence:: Runs entirely offline with models that scale from low-end hardware to high-performance rigs."
    ],
    "roadmap": {
      "nearTerm": [
        "Open-source Code Release",
        "Initial Bug Fixes & Stability",
        "Model Optimization for Low-end Devices"
      ],
      "midTerm": [
        "Community Feedback Integration",
        "Extended Persona Customization",
        "Enhanced Formatting Options"
      ],
      "longTerm": "The vision is to make BetterFingers smarter through deeper system integrations, enhanced button mappings, and hotkey meshing. We aim to continuously improve the underlying models to provide even more accurate and nuanced expression, ensuring the tool evolves with the user's needs."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "Only for downloads/updates",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device only"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Releases",
        "url": "",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Demo",
        "url": "",
        "type": "video"
      }
    ]
  },
  {
    "id": "dream-tool",
    "featured": false,
    "realName": "Dream Tool",
    "codename": "Oneiromancy",
    "category": "productivity",
    "status": "prototype",
    "statusLabel": "DREAMING",
    "tagline": "Lucid Dreaming Assistant and Whiteboard.",
    "plainDescription": "An AI-powered thought organizer, whiteboard, and project commander that structures chaos into actionable steps for any creation.",
    "flavorDescription": "A digital staff for the modern wizard, summoning order from the chaos of the mind and manifesting thoughts into reality through the weave of code and image.",
    "fullDescription": [
      "Dream Tool is a \"one-stop shop\" for organizing thoughts and building *anything*—from a simple email to an entire ecosystem. It functions as a mind map, text editor, and whiteboard, but leverages open-source AI to act as a \"commander\" for your dreams. It doesn't just store ideas; it actively helps you plan, research, and execute them.",
      "The tool features a hierarchy leveling system that adapts to the scale of your project. For quick tasks, it offers a rapid, low-level planning stage. For complex endeavors, it scales up to help you build universes, research continuously using local and web resources, and visualize concepts with image generation. It is the bridge between the ethereal thought and the concrete action."
    ],
    "features": [
      "AI-Driven Project Planning & hierarchy API",
      "Infinite Whiteboard for Visualization",
      "Integrated Web & Local Research Agent",
      "Adaptive Project Scoping (Micro to Macro)",
      "Image Generation for Inspiration",
      "Text Editor & To-Do List Integration",
      "Mind Mapping & Data Charting",
      "Actionable Step Generation"
    ],
    "flagshipFeatures": [
      "Dream Commander:: An AI agent that breaks down abstract goals into concrete, actionable steps and to-do lists.",
      "Adaptive Hierarchy:: Automatically scales the complexity of the workspace based on the project size—from 1-minute tasks to multi-year ecosystem builds.",
      "Active Research Assistant:: Autonomously finds relevant information from the web or local files to support your specific creative task."
    ],
    "roadmap": {
      "nearTerm": [
        "Core Whiteboard Implementation",
        "Basic Local LLM Integration",
        "Task List Generation Logic"
      ],
      "midTerm": [
        "Web Research Agent Capabilities",
        "Image Generation Integration",
        "Project Hierarchy Scaling System"
      ],
      "longTerm": "The ultimate vision is to create a tool that feels like \"pixie dust\" for creation—removing all friction between having an idea and executing it. It will evolve into a fully autonomous partner that can not only plan but assist in the actual creation of assets, code, and content, effectively becoming a second brain that works while you sleep."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "For Web Research & Updates",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device only"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Releases",
        "url": "",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Demo",
        "url": "",
        "type": "video"
      }
    ]
  },
  {
    "id": "dungeon-creator",
    "featured": false,
    "realName": "Deep Stone",
    "codename": "Deep Stone",
    "category": "productivity",
    "status": "concept",
    "statusLabel": "UNMINED",
    "tagline": "Automated 2D top-down map creator for worlds.",
    "plainDescription": "A tool for rapidly generating coherent, multi-layered 2D top-down maps for TTRPGs and video games.",
    "flavorDescription": "Prompt worlds to play in—a forge for imagining at a higher level and manifesting your dreamscapes into playable realities.",
    "fullDescription": [
      "Deep Stone is an automated creator for 2D top-down maps, designed to let you \"think out\" your worldbuilding ideas. It goes beyond simple tile placement by offering a massive layered system—allowing for coherent structures with basements, floors, and subfloors. It serves as a rapid creation engine for TTRPG masters and game developers alike, giving them the tools to adjust, expand, and fine-tune the \"vibe\" of their world without painstakingly placing every pixel.",
      "It allows you to import custom tile sets or works from artists and \"transcribe\" them into workable building blocks. The system learns from your critiques, refining its generation to match your personal style. It acts as a bridge between imagination and table-ready assets, and will eventually power the generation of environments for the *Infinite Ages* system."
    ],
    "features": [
      "Multi-Layered Map Generation (Basements, Floors, etc.)",
      "Dynamic Object & Collision Placement",
      "Custom Tile Set \"Transcription\" & Training",
      "Style & Vibe Fine-Tuning",
      "Automated Coherence Checks",
      "Rapid 2D Top-Down Layouts",
      "Export to Common Formats (JSON/PNG)",
      "Local & Private Storage"
    ],
    "flagshipFeatures": [
      "Deep Layering System:: compile complex, multi-story structures (mansions, dungeons) into a single, coherent map file.",
      "Tile Set Transcription:: Import external artist assets and automatically convert them into usable, intelligent tile logic.",
      "Generative Critique Loop:: Train the generator by critiquing its outputs, refining it to produce maps that match your specific vision."
    ],
    "roadmap": {
      "nearTerm": [
        "Core Generation Algorithm Design",
        "Basic Tile Set Import Logic",
        "Layered Data Structure Definition"
      ],
      "midTerm": [
        "UI for \"Vibe\" Adjustment",
        "Collision & Object Metadata Support",
        "Integration with *Infinite Ages*"
      ],
      "longTerm": "Deep Stone aims to become a fundamental piece of the puzzle for digital tabletop experiences and indie game development. The goal is to create a private, offline-first tool that removes the tedium of mapping, allowing creators to focus on the story and the experience."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "No (unless downloading updates)",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device only"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Releases",
        "url": "",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Demo",
        "url": "",
        "type": "video"
      }
    ]
  },
  {
    "id": "hobbies-hundreds",
    "featured": false,
    "realName": "HobbiesToHundreds",
    "codename": "Alchemy Kit",
    "category": "finance",
    "status": "concept",
    "statusLabel": "ALCHEMY",
    "tagline": "Turning personal passions into sovereign income streams.",
    "plainDescription": "A personal growth and financial planning app that helps you identify, map, and monetize your existing hobbies and interests.",
    "flavorDescription": "The Alchemist’s guide to transmuting the lead of leisure into the gold of freedom, revealing the hidden value in what you already love.",
    "fullDescription": [
      "HobbiesToHundreds is a concept dedicated to financial freedom through personal authenticity. Unlike generic business guides, it starts with *you*—taking what you already know and do, and mapping out a path to benefit from it financially. It acts as a deeply personal consultant, analyzing your interests—whether it's restoring furniture, thrifting, or content creation—and researching the viability of those paths specifically for you.",
      "This is a \"canon project\" designed to be private, local, and free. It functions as a simulator for your potential futures, allowing you to \"dreamscape\" scenarios (e.g., \"What if I started a YouTube channel?\"). It provides structure, warns against overextension, and relates the success patterns of others directly to your unique position. It is designed to figure you out and find the answers that fit your life, requiring significant investment from both the user and the system to build a truly sovereign future."
    ],
    "features": [
      "Personalized Hobby Viability Analysis",
      "\"Dreamscape\" Scenario Simulation",
      "Step-by-Step Financial Roadmapping",
      "Niche Market Research Agent",
      "Risk & Overextension Warnings",
      "Success Pattern Matching (Case Studies)",
      "Privacy-First Financial Planning",
      "Passive Income \"Alchemy\" Guides"
    ],
    "flagshipFeatures": [
      "The Dreamscape Simulator:: Simulates potential outcomes for different business ventures based on real-world data, letting you \"live\" the scenario before starting.",
      "Personalized Pathfinding:: Analyzes your specific skills and interests to generate a unique, step-by-step roadmap to monetization.",
      "Sovereign Consultant:: A private, local AI that learns your financial anxiety and goals to provide tailored, specific advice without exposing your data."
    ],
    "roadmap": {
      "nearTerm": [
        "Concept Architecture Design",
        "User Interest Profiling System",
        "Basic Niche Research Logic"
      ],
      "midTerm": [
        "\"Dreamscape\" Simulation Engine Prototype",
        "Financial Goal Tracking Integration",
        "Case Study Database Connection"
      ],
      "longTerm": "This is a massive undertaking intended to be the ultimate tool for self-reliant wealth generation. The long-term vision is a fully private AI that can act as a silent business partner, continuously scanning the market for opportunities that align with your evolving interests and guiding you toward total financial independence."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "For Market Research & Updates",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device only"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Releases",
        "url": "",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Demo",
        "url": "",
        "type": "video"
      }
    ]
  },
  {
    "id": "infinite-ages",
    "featured": true,
    "realName": "Infinite Ages Genesis",
    "codename": "Aether Bound",
    "category": "games",
    "status": "beta",
    "statusLabel": "AWAKENING",
    "tagline": "Explore infinite worlds across infinite ages.",
    "plainDescription": "A classless, narrative-driven TTRPG engine built for simulating any world—from medieval fantasy to sci-fi piracy—under a unified system.",
    "flavorDescription": "The architecture of the multiverse laid bare, granting you the power to weave destiny across stars and centuries without the chains of class or era.",
    "fullDescription": [
      "*Infinite Ages Genesis* is a world simulation and narrative storytelling engine that breaks the mold of traditional TTRPGs. It is a completely classless system designed for player-driven and GM-driven storytelling, set within the vast \"USSI\" framework. This setting allows Game Masters to drop players into literally *any* world they can imagine—whether it's a grit-filled medieval planet, a sleek modern metropolis, a colonial frontier, or a chaotic sci-fi pirate flotilla—all while keeping the core mechanics consistent.",
      "The system distinguishes itself with a unique \"learning by doing\" progression. Instead of arbitrary experience points, your character evolves through action. Utilize your \"Artist\" or \"Athlete\" skills, or engage in charisma-based diplomacy; success grants skill levels, which in turn drive your overall character level, PowerPoints, and HP. With 10 distinct superpowers featuring massive skill trees, a deep cybernetics system, comprehensive crafting, and a unique combat flow using a full 7-dice set (d20-d100), it offers a depth of play that is expansive yet manageable.",
      "**NOTE:** Demo videos and project images coming soon. Character sheets will be available in February 2026."
    ],
    "features": [
      "Classless Progression:: Build exactly the character you want without arbitrary restrictions.",
      "Universal Setting (USSI):: Seamlessly transition between genres (Fantasy, Sci-Fi, Modern, Western).",
      "Usage-Based Leveling:: Skills level up as you successfully use them, driving character growth organically.",
      "Superpower Skill Trees:: 10 distinct power sets with massive, deep branching paths.",
      "Cybernetics & Crafting:: Robust systems for augmenting characters and creating gear.",
      "Unified Dice System:: Utilizes d20, d12, d10, d6, d4, and d100.",
      "Dynamic Status Effects:: A complex status system that impacts gameplay meaningfully.",
      "Beta Tested:: Hand-built and refined over years of actual play."
    ],
    "flagshipFeatures": [
      "The USSI Framework:: A narrative device that justifies and enables infinite diversity in settings, allowing a single campaign to span across wildly different worlds and genres.",
      "Organic Skill Evolution:: A progression system where your character becomes what they *do*. If you negotiate, you become a diplomat; if you fight, you become a warrior—no pre-selected paths required.",
      "Superpower Integration:: A deep power system that integrates seamlessly with mundane skills, allowing for characters that blend magic, tech, and natural talent."
    ],
    "roadmap": {
      "nearTerm": [
        "GM Guide:: A comprehensive manual for running operations in the USSI.",
        "Online Character Sheet:: A web-based, manageable sheet for tracking the complex stats and skill trees (Feb 2026).",
        "Campaign Module:: A starter adventure to introduce players to the mechanics and setting."
      ],
      "midTerm": [
        "GM Toolkit:: A suite of digital tools to assist in world generation and management.",
        "Local Session Notes:: A private, \"Better Notes\"-style application for taking campaign notes that stay ensuring no data leaks.",
        "Conclusive World Lore Book:: The definitive guide to the history and secrets of the Infinite Ages universe."
      ],
      "longTerm": "The ultimate horizon for *Infinite Ages* is the development of a proprietary Virtual Tabletop (VTT). Unlike commercial VTTs that lock data in the cloud, this will be a privacy-focused, self-hosted solution. It will allow GMs to host their own sessions directly from their machines (Direct Connect), ensuring that your campaigns, your worlds, and your stories remain yours alone. It represents the shift from just a book to a complete digital ecosystem for offline-first play."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "Yes (For VTT connections/updates)",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device (VTT is self-hosted)"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Download TTRPG",
        "url": "assets/InfiniteAgesGenesis.pdf",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Demo",
        "url": "",
        "type": "video"
      }
    ]
  },
  {
    "id": "pdf-manager",
    "featured": true,
    "realName": "PDF Editor/Manager",
    "codename": "Codex Forge",
    "category": "productivity",
    "status": "alpha",
    "statusLabel": "FORGING",
    "tagline": "Sovereign document manipulation.",
    "plainDescription": "A local PDF editor and manager offering OCR, text-to-speech conversion, and document signing without subscriptions.",
    "flavorDescription": "A tool for the scribes of the new age, unsealing the locked scrolls of the old world and giving voice to the silent text within.",
    "fullDescription": [
      "*Codex Forge* (Pdf Manager) is a pragmatic tool designed to break the chains of subscription-based PDF software. It is not meant to be a revolutionary overhaul of the file format, but a sovereign utility that lets you simply *work*. Whether you need to sign a document, add a field, or manipulate a page, this tool handles it locally and privately.",
      "Its standout feature is the integration of local AI for Optical Character Recognition (OCR) and Text-to-Speech (TTS). It can take dense research papers or scanned images and convert them into audio files overnight, allowing you to \"read\" complex documents while driving or commuting. It transforms static, locked data into accessible, portable knowledge."
    ],
    "features": [
      "Local PDF Editing:: Add fields, sign documents, and manipulate pages.",
      "Offline OCR:: Convert scanned images and PDFs into searchable, editable text.",
      "Text-to-Speech (TTS) Conversion:: Turn entire documents into downloadable audio files.",
      "Subscription-Free:: A one-time tool to replace costly monthly services.",
      "Batch Processing:: \"Chug away\" at large documents overnight.",
      "Image-to-Text:: Extract text capabilities for standard image files.",
      "Dream Tool Integration:: Designed to work alongside the Dream Tool ecosystem.",
      "Privacy First:: No cloud uploads; your documents stay on your machine."
    ],
    "flagshipFeatures": [
      "Sovereign Signing:: Complete digital signatures and form filling without relying on third-party verification servers or unnecessary clouds.",
      "Document-to-Audio:: A \"read-it-later\" engine that converts massive PDFs into audiobooks for passive consumption.",
      "Universal OCR:: Unlocks text from any static image or PDF, making every document in your library searchable and accessible."
    ],
    "roadmap": {
      "nearTerm": [
        "Basic PDF Rendering & Viewing",
        "Form Filling & Signing Logic",
        "Alpha OCR Implementation"
      ],
      "midTerm": [
        "Text-to-Speech Audio Export",
        "Batch Processing Queue",
        "Integration with Dream Tool"
      ],
      "longTerm": "The long-term goal is to provide a robust, free alternative to the industry giants that gatekeep basic document functionality. It aims to save users time and money by offering a reliable, private suite of tools that just work—eventually becoming a standard utility for anyone who values data sovereignty."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "No",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device only"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Releases",
        "url": "",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Demo",
        "url": "",
        "type": "video"
      }
    ]
  },
  {
    "id": "roguelike-crawler",
    "featured": false,
    "realName": "Roguelike Crawler",
    "codename": "Iron Descent",
    "category": "games",
    "status": "prototype",
    "statusLabel": "DESCENDING",
    "tagline": "A turn-based LLM-driven dungeon crawl demo.",
    "plainDescription": "A one-shot, static page demo game showcasing the *Infinite Ages* rules and *Deep Stone* map generation, driven by a local LLM storyteller.",
    "flavorDescription": "A descent into a never-ending dark, where the world remembers your bones even as your new soul takes its first breath.",
    "fullDescription": [
      "*Iron Descent* is a \"play pretend\" engine—a piece of interactive entertainment designed to demonstrate the capabilities of the *Deep Stone* map creator and the *Infinite Ages* ruleset. It is a 2D top-down, turn-based roguelike where the dungeon master is a simple but elegant local LLM. It allows users to run through solo adventures with randomized loot and NPCs, experiencing the mechanics of the larger system in a contained, fun environment.",
      "Currently, this project sits low on the priority list, serving as a reward for when the productivity tools are complete. It creates a space for pure enjoyment, testing the limits of what a browser-based, offline-first AI game can look like."
    ],
    "features": [
      "Local LLM Dungeon Master:: An AI that narrates and manages the adventure offline.",
      "Infinite Ages Ruleset:: Runs on the same mechanics as the TTRPG.",
      "Deep Stone Map Integration:: Uses maps generated by the *Deep Stone* tool.",
      "Persistent World State:: The world remains and remembers previous runs/deaths.",
      "Turn-Based Combat:: Classic tactical gameplay.",
      "Randomized Loot & NPCs:: Endless variety in every run.",
      "Static Page Architecture:: Runs entirely in the browser without complex backend requirements."
    ],
    "flagshipFeatures": [
      "AI Story Mode:: A solo adventure guide that adapts the narrative to your actions using local intelligence.",
      "Legacy World:: A \"never-ending\" open world where your new characters exist in the same continuity as your dead ones.",
      "Tech Demo Synergy:: Acts as the playable proof-of-concept for both the *Deep Stone* map maker and *Infinite Ages* system."
    ],
    "roadmap": {
      "nearTerm": [
        "Basic Movement & Collision Logic",
        "Simple Combat Loop Implementation",
        "LLM Flavor Text Integration"
      ],
      "midTerm": [
        "Inventory & Loot Tables",
        "NPC Interaction System",
        "Deep Stone Map Import"
      ],
      "longTerm": "The vision is to build a massive, never-ending open world. When you die, you don't reset the world—you essentially respawn as a new character in the same history you helped create. It aims to be a \"living\" rogue-like where your past actions echo into your future runs."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "No",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device only"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Releases",
        "url": "",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Demo",
        "url": "",
        "type": "video"
      }
    ]
  },
  {
    "id": "space-shooter",
    "featured": false,
    "realName": "Stardust",
    "codename": "Stardust",
    "category": "games",
    "status": "archived",
    "statusLabel": "DRIFTING",
    "tagline": "Physics-based space racing and crystal collection demo.",
    "plainDescription": "A speed-running tech demo where you pilot a ship with real physics to collect crystals and race against the clock.",
    "flavorDescription": "Dance through the void on the edge of drift, harvesting the crystallized light of dead stars before the darkness catches up.",
    "fullDescription": [
      "*Stardust* (formerly \"Roadmap Game\") is a study in momentum and mastery. It is currently a tech demo focused on high-speed traversal using real physics. Players must navigate asteroid fields, collect crystals, and manage their ship's drift to achieve the fastest times.",
      "While currently a solo experience, it serves as the foundation for a much larger vision: a chaotic, tag-team tactical shooter where piloting and systems management are split between two players. For now, it remains a testbed for flight mechanics and a challenge for those who enjoy the purity of time trials."
    ],
    "features": [
      "Physics-Based Flight:: Momentum, drift, and thrust mechanics.",
      "Time Trial Mode:: Race against the clock for the best time.",
      "Crystal Collection:: Precision flying targets.",
      "Dynamic Asteroid Fields:: Procedural obstacles (planned).",
      "Tech Demo Status:: A raw showcase of the engine's potential.",
      "Browser Play:: Runs directly in the web browser."
    ],
    "flagshipFeatures": [
      "Newtonian Flight Model:: Experience space travel where inertia is your best friend and worst enemy.",
      "Speed-Run Focus:: Designed for mastery, where shaving milliseconds requires perfect execution.",
      "Co-op Foundation:: The underlying engine built to eventually support split-role multi-crew ships."
    ],
    "roadmap": {
      "nearTerm": [
        "Leaderboard Integration (if server available)",
        "Basic Ship Customization (Visuals)",
        "Enhanced Level Design"
      ],
      "midTerm": [
        "Multiplayer Port Forwarding Support",
        "\"Tag-Team\" 2v2 Mode Prototype",
        "5-Level Campaign Structure"
      ],
      "longTerm": "The ultimate vision is a 2v2 tactical arena shooter. Teams of two share a single ship: one player pilots, managing the physics and evasion, while the other acts as Gunner/Engineer, managing shields, weapons, and repairs. Teams fight through PVE levels to reach a final PVP arena, testing their coordination and communication in a high-stakes dogfight."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "No (Leaderboards would require it)",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device only"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Releases",
        "url": "",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Play Demo",
        "url": "projects/space-shooter.html",
        "type": "demo"
      }
    ]
  },
  {
    "id": "the-account",
    "featured": false,
    "realName": "The Accountant",
    "codename": "Ledger Zero",
    "category": "finance",
    "status": "concept",
    "statusLabel": "ZEROING",
    "tagline": "Private wealth tracking and financial freedom simulation.",
    "plainDescription": "An offline-first ledger app that organizes income, analyzes spending via OCR, and runs local AI simulations to plan your path to debt freedom.",
    "flavorDescription": "A digital companion for your financial journey, illuminating the path from debt to sovereignty without ever whispering your secrets to the cloud.",
    "fullDescription": [
      "*The Accountant* is a private wealth tracker designed to give you an uncompromising picture of your financial reality. It leverages local OCR and AI to ingest your bank statements, income, and subscriptions, organizing them into a clear, actionable dashboard. Unlike other finance apps, it is completely offline and private—it never touches the internet, ensuring your financial life remains yours alone.",
      "More than just a tracker, it is a simulation engine. It allows you to propose scenarios to a local LLM—\"What happens if I buy this car?\", \"How long to pay off this debt if I cancel these subscriptions?\"—and receive reasoned probabilities and plans. It is built to communicate modularly with *Hobbies to Hundreds*, allowing for a holistic view of your wealth generation and preservation strategies without leaking data between them."
    ],
    "features": [
      "Private Ledger:: Complete offline tracking of income, debt, and expenses.",
      "Local AI Simulation:: Ask \"what if\" questions and get reasoned financial projections.",
      "OCR Statement Ingestion:: Automatically parse bank statements and receipts locally.",
      "Debt Payoff Planning:: Strategic mapping to clear debts efficiently.",
      "Subscription Management:: Identifies and helps cull recurring costs.",
      "Hardware Adaptive:: Runs on everything from low-end laptops to high-end rigs.",
      "Hobbies to Hundreds Bridge:: Secure, private data sharing for income planning.",
      "Mobile Sync:: Offline file transfer to keep finances updated on the go."
    ],
    "flagshipFeatures": [
      "Financial Sim Games:: Run complex scenarios to see how major life decisions (starting a business, buying a house) impact your long-term stability before you make them.",
      "Sovereign Data Silo:: A completely air-gapped financial environment that refuses to share your telemetry or habits with advertisers.",
      "Adaptive Counsel:: The AI adjusts its advice based on your explicit goals—whether it's raising credit, saving for a safety net, or aggressive investment—acting as a personalized, private CFO."
    ],
    "roadmap": {
      "nearTerm": [
        "Core Ledger & Data Entry UI",
        "Hardware-Adaptive Model Selection",
        "Basic OCR Integration for Statements"
      ],
      "midTerm": [
        "\"Scenario\" Simulation Engine Prototype",
        "*Hobbies to Hundreds* Data Bridge",
        "Mobile Data Sync Logic"
      ],
      "longTerm": "The mission of *The Accountant* is to guide users to a place of total financial security—having a savings net, zero debt, and the freedom to take risks. It aims to democratize high-level financial planning, making the tools for wealth preservation free, accessible, and private for everyone, regardless of their hardware or status."
    },
    "trustFacts": {
      "runsOffline": false,
      "requiresInternet": "No",
      "telemetry": "None",
      "accounts": "None",
      "dataStoredWhere": "Local device only"
    },
    "links": [
      {
        "label": "GitHub",
        "url": "",
        "type": "github"
      },
      {
        "label": "Releases",
        "url": "",
        "type": "download"
      },
      {
        "label": "Docs",
        "url": "",
        "type": "docs"
      },
      {
        "label": "Demo",
        "url": "",
        "type": "video"
      }
    ]
  }
]